app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2020-02-23 12:32:18.101918"], ["id", 1]]
---
  def update
    # raise params.inspect
    @article = Article.find(params[:id])
    @article.title = params[:article][:title]
    @article.description = params[:article][:description]
    @article.save